In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("H:\Student_Performance\data\StudentsPerformance.csv")

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df['Average Score'] = df[['math score']+['reading score']+['writing score']].mean(axis=1)

In [8]:
df.drop(columns={'gender','race/ethnicity','parental level of education','lunch','test preparation course'},axis=1,inplace=True)

In [9]:
df.head()

   math score  reading score  writing score  Average Score
0          72             72             74      72.666667
1          69             90             88      82.333333
2          90             95             93      92.666667
3          47             57             44      49.333333
4          76             78             75      76.333333

In [20]:
df['Result'] = ''

In [21]:
df.head()

   math score  reading score  writing score  Average Score Result
0          72             72             74      72.666667
1          69             90             88      82.333333
2          90             95             93      92.666667
3          47             57             44      49.333333
4          76             78             75      76.333333

In [22]:
df.isna().sum()

math score       0
reading score    0
writing score    0
Average Score    0
Result           0
dtype: int64

In [23]:
for i in range(len(df)):
    if df.loc[i,'Average Score'] >= 50:
        df.loc[i,'Result'] = 'Pass'
    else:
        df.loc[i,'Result'] = 'Fail'

In [24]:
df.head()

   math score  reading score  writing score  Average Score Result
0          72             72             74      72.666667   Pass
1          69             90             88      82.333333   Pass
2          90             95             93      92.666667   Pass
3          47             57             44      49.333333   Fail
4          76             78             75      76.333333   Pass

In [27]:
df.drop(columns={'Average Score'},axis=1,inplace=True)

In [28]:
df.head()

   math score  reading score  writing score Result
0          72             72             74   Pass
1          69             90             88   Pass
2          90             95             93   Pass
3          47             57             44   Fail
4          76             78             75   Pass

##### Ready to train model